---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewSpaceSet
source: html/ca48d367-2929-2e95-4a7a-d9f804497756.htm
---
# Autodesk.Revit.Creation.Application.NewSpaceSet Method

Creates a new instance of a space set.

## Syntax (C#)
```csharp
public SpaceSet NewSpaceSet()
```